In [185]:
import pandas as pd
import numpy as np

In [186]:
df_path = './data/ATO_TaxStatistics_2016-2017_Table14.xlsx'

In [187]:
df = pd.read_excel(df_path, sheet_name=2, skiprows=3)

In [188]:
df.head()

,Income Year2,Occupation - unit group1,Sex,Taxable income ranges (tax brackets),Number of individuals no.,Salary or wages no.,Salary or wages $,Total Income or Loss3 no.,Total Income or Loss3 $,Work related car expenses no.,...,Total business income3 no.,Total business income3 $,Total business expenses3 no.,Total business expenses3 $,Net income or loss from business no.,Net income or loss from business $,Taxable income or loss3 no.,Taxable income or loss3 $,Net tax no.,Net tax $
0,2010–11,0000 Occupation blank,Female,"a. $6,000 or less",1770,955,4067170,1715,7537518,175,...,75,1631032,75,4468109,85,-275448,1505,5473700,na,24374.0
1,2010–11,0000 Occupation blank,Female,"c. $6,001 to $37,000",9615,7060,130703992,9615,193915847,1350,...,315,8624906,295,6088036,355,2549458,9615,182153329,na,7454251.0
2,2010–11,0000 Occupation blank,Female,"e. $37,001 to $80,000",3950,3640,186669157,3950,215103005,930,...,90,7747604,80,5382947,90,1595710,3950,207133691,na,35975752.0
3,2010–11,0000 Occupation blank,Female,"f. $80,001 to $180,000",780,665,62536488,780,85084180,205,...,20,2041211,20,1273453,20,745858,780,81900138,na,21732178.0
4,2010–11,0000 Occupation blank,Female,"h. $180,001 or more",85,55,13285616,85,30877953,25,...,5,1136352,5,420460,5,631887,85,29624110,na,11202899.0

# Cleaning
we need to convert 'Occupation ...' into the ANZSCO codes

We also need to drop when 'Occupation ...' == Other

In [189]:
df = df[df['Occupation - unit group1']!='Other'].copy()
df['Occupation - unit group1'] = pd.to_numeric(df['Occupation - unit group1'].str[0:4])
df.rename(columns={'Occupation - unit group1': "ANZSCO", 'Income Year2': 'IncomeYear'}, inplace=True)

In [190]:
df.head()

,IncomeYear,ANZSCO,Sex,Taxable income ranges (tax brackets),Number of individuals no.,Salary or wages no.,Salary or wages $,Total Income or Loss3 no.,Total Income or Loss3 $,Work related car expenses no.,...,Total business income3 no.,Total business income3 $,Total business expenses3 no.,Total business expenses3 $,Net income or loss from business no.,Net income or loss from business $,Taxable income or loss3 no.,Taxable income or loss3 $,Net tax no.,Net tax $
0,2010–11,0,Female,"a. $6,000 or less",1770,955,4067170,1715,7537518,175,...,75,1631032,75,4468109,85,-275448,1505,5473700,na,24374.0
1,2010–11,0,Female,"c. $6,001 to $37,000",9615,7060,130703992,9615,193915847,1350,...,315,8624906,295,6088036,355,2549458,9615,182153329,na,7454251.0
2,2010–11,0,Female,"e. $37,001 to $80,000",3950,3640,186669157,3950,215103005,930,...,90,7747604,80,5382947,90,1595710,3950,207133691,na,35975752.0
3,2010–11,0,Female,"f. $80,001 to $180,000",780,665,62536488,780,85084180,205,...,20,2041211,20,1273453,20,745858,780,81900138,na,21732178.0
4,2010–11,0,Female,"h. $180,001 or more",85,55,13285616,85,30877953,25,...,5,1136352,5,420460,5,631887,85,29624110,na,11202899.0

In [191]:
# For some godforsaken reason, the hyphen in the IncomeYear columns isn't a hyphen, it's this: –
# Let's fix that
df['IncomeYear'] = df['IncomeYear'].str.replace('–','-')

# Also there are manually entered 'na's
df.replace('na', np.nan, inplace=True)

In [192]:
df['ANZSCO'].unique()

array([   0, 1100, 1111, 1112, 1113, 1210, 1211, 1212, 1213, 1214, 1311,
       1321, 1322, 1323, 1324, 1325, 1331, 1332, 1333, 1334, 1335, 1336,
       1341, 1342, 1343, 1344, 1351, 1391, 1392, 1399, 1411, 1412, 1413,
       1414, 1419, 1421, 1491, 1492, 1493, 1494, 1499, 2111, 2112, 2113,
       2114, 2120, 2121, 2122, 2123, 2124, 2211, 2212, 2220, 2221, 2222,
       2223, 2231, 2232, 2233, 2241, 2242, 2243, 2244, 2245, 2246, 2247,
       2249, 2251, 2252, 2253, 2254, 2300, 2311, 2312, 2320, 2321, 2322,
       2323, 2324, 2325, 2326, 2330, 2331, 2332, 2333, 2334, 2335, 2336,
       2339, 2340, 2341, 2342, 2343, 2344, 2345, 2346, 2347, 2349, 2400,
       2410, 2411, 2412, 2413, 2414, 2415, 2419, 2421, 2422, 2491, 2492,
       2493, 2511, 2512, 2513, 2514, 2515, 2519, 2521, 2522, 2523, 2524,
       2525, 2526, 2527, 2530, 2531, 2532, 2533, 2534, 2535, 2539, 2540,
       2541, 2542, 2543, 2544, 2600, 2610, 2611, 2612, 2613, 2621, 2631,
       2632, 2633, 2711, 2712, 2713, 2721, 2722, 2723, 2724, 2725, 2726,
       3111, 3112, 3113, 3114, 3120, 3121, 3122, 3123, 3124, 3125, 3126,
       3129, 3131, 3132, 3211, 3212, 3221, 3222, 3223, 3231, 3232, 3233,
       3234, 3241, 3242, 3243, 3311, 3312, 3321, 3322, 3331, 3332, 3333,
       3334, 3341, 3411, 3421, 3422, 3423, 3424, 3511, 3512, 3513, 3514,
       3611, 3612, 3613, 3621, 3622, 3623, 3624, 3911, 3920, 3921, 3922,
       3923, 3931, 3932, 3933, 3941, 3942, 3991, 3992, 3993, 3994, 3995,
       3996, 3999, 4110, 4111, 4112, 4113, 4114, 4115, 4116, 4117, 4211,
       4221, 4230, 4231, 4232, 4233, 4234, 4310, 4311, 4312, 4313, 4314,
       4315, 4319, 4411, 4412, 4413, 4421, 4422, 4511, 4512, 4513, 4514,
       4515, 4516, 4517, 4518, 4521, 4522, 4523, 4524, 5100, 5111, 5121,
       5122, 5211, 5212, 5300, 5310, 5311, 5321, 5411, 5412, 5421, 5511,
       5512, 5513, 5521, 5522, 5523, 5610, 5611, 5612, 5613, 5614, 5615,
       5616, 5619, 5911, 5912, 5991, 5992, 5993, 5994, 5995, 5996, 5997,
       5999, 6111, 6112, 6113, 6121, 6200, 6211, 6212, 6213, 6214, 6215,
       6216, 6217, 6219, 6311, 6391, 6392, 6393, 6394, 6395, 7100, 7111,
       7112, 7113, 7114, 7115, 7116, 7117, 7119, 7121, 7122, 7123, 7129,
       7210, 7211, 7212, 7213, 7219, 7300, 7311, 7312, 7313, 7321, 7331,
       7411, 8110, 8111, 8112, 8113, 8114, 8115, 8116, 8200, 8210, 8211,
       8212, 8213, 8214, 8215, 8216, 8217, 8219, 8300, 8310, 8311, 8312,
       8313, 8321, 8322, 8391, 8392, 8393, 8394, 8399, 8410, 8411, 8412,
       8413, 8414, 8415, 8416, 8419, 8511, 8512, 8513, 8910, 8911, 8912,
       8991, 8992, 8993, 8994, 8995, 8996, 8997, 8999, 9133, 9221, 9222,
       9223, 9224, 9225, 9232, 9233, 9234, 9250, 9251, 9254, 9261, 9311,
       9313, 9321, 9322, 9323, 9324, 9331, 9332, 9333, 9334, 9341, 9342,
       9351, 9361, 9362, 9391, 9392, 9393, 9394, 9399, 9410, 9420, 9431,
       9442, 9451, 9452, 9510, 9530, 9550, 9552, 9599, 9611, 9612, 9621,
       9712, 9730, 9741, 9811, 9831, 9841, 9899, 9990, 9997, 2500, 3900,
       4420, 4500, 6110])

In [193]:
df['IncomeYear'].unique()

array(['2010-11', '2011-12', '2012-13', '2013-14', '2014-15', '2015-16',
       '2016-17'], dtype=object)

In [194]:
df['Sex '].unique()

array(['Female', 'Male'], dtype=object)

It looks like `'i. all ranges'` or `'j. all ranges'` isn't populated for some of the earlier financial years. We should do that first

In [195]:
list_fy = df['IncomeYear'].unique()
list_sex = df['Sex '].unique()
list_anzsco = df['ANZSCO'].unique()
list_brackets = df['Taxable income ranges (tax brackets) '].unique()

In [196]:
count_agg = 0
count_dummy = 0

bool_sex = {}
bool_fy = {}

data_append = []

for sex in list_sex:
    bool_sex[sex] = df['Sex ']==sex
for fy in list_fy:
    bool_fy[fy] = df['IncomeYear']==fy

for fy in list_fy:
    for sex in list_sex:
        bool_tmp = bool_fy[fy] & bool_sex[sex]
        for code in list_anzsco:
            bool_code = df['ANZSCO']==code
            
            df_tmp = df[ bool_tmp &
                         bool_code
                       ].copy()
            if len(df_tmp)==0:
                # this entry is empty; we should populate it
                # this might happen if a new ocupation code appeared, or was empty, etc.
                dummy_row = [0 for col in df.columns]
                dummy_row[0:4] = [fy, code, sex, 'k. all ranges']
                data_append.append(dummy_row)
                count_dummy += 1
            else:
                # we need to check if an aggregated row already exists
                if not any( [bs in df_tmp['Taxable income ranges (tax brackets) '].unique() for bs in ['i. all ranges', 'j. all ranges'] ]):
                    # let's create an aggregated row
                    agg_row = df_tmp.sum().values
                    agg_row[0:4] = [fy, code, sex, 'k. all ranges']
                    data_append.append(agg_row)
                    count_agg += 1

In [216]:
df_tmp = df.append(pd.DataFrame(data=data_append, columns=df.columns)).copy().reset_index(drop=True)

In [220]:
df_final = df_tmp[  (df_tmp['Taxable income ranges (tax brackets) ']=='i. all ranges') |
         (df_tmp['Taxable income ranges (tax brackets) ']=='j. all ranges') |
         (df_tmp['Taxable income ranges (tax brackets) ']=='k. all ranges')].reset_index(drop=True).copy()

# Done!
Now `df_final` contains the aggregated tax statistics for each triple `(income year, anzco, sex)`

In [223]:
df_final.sample(20)

,IncomeYear,ANZSCO,Sex,Taxable income ranges (tax brackets),Number of individuals no.,Salary or wages no.,Salary or wages $,Total Income or Loss3 no.,Total Income or Loss3 $,Work related car expenses no.,...,Total business income3 no.,Total business income3 $,Total business expenses3 no.,Total business expenses3 $,Net income or loss from business no.,Net income or loss from business $,Taxable income or loss3 no.,Taxable income or loss3 $,Net tax no.,Net tax $
1425,2010-11,4521,Female,k. all ranges,9730,9500,204726058,9720,286153072,2995,...,2530,47351780,2405,29393065,2560,16810852,9575,266097917,0.0,3.143686e+07
5683,2016-17,2245,Female,k. all ranges,1165,1158,83229864,1165,92766214,776,...,40,1564104,37,1282341,44,217866,1164,85059828,1085.0,2.052038e+07
6160,2016-17,3941,Male,k. all ranges,18823,18620,954426581,18821,1040213794,9041,...,1383,63849500,1316,45278544,1394,18080915,18818,980301063,16991.0,1.856056e+08
4981,2014-15,7321,Male,k. all ranges,34561,33844,1215192946,34538,1369333698,9261,...,2258,106377130,2077,84551729,2298,20419990,34516,1306630435,25755.0,1.897290e+08
4302,2013-14,3422,Male,k. all ranges,10919,10885,1033393338,10919,1066256425,5046,...,279,26036538,290,27314616,308,-1921907,10919,1019579575,10693.0,2.630642e+08
733,2015-16,3234,Female,i. all ranges,27,27,1197690,27,1527462,6,...,3,87056,3,87979,3,-923,27,1480225,23.0,2.888140e+05
1495,2010-11,7122,Female,k. all ranges,2240,2235,180687082,2240,179227823,550,...,55,2063742,65,2202870,65,-233398,2225,174715341,0.0,4.186355e+07
2546,2011-12,1331,Male,k. all ranges,46670,45535,3977179994,46655,4487551400,18800,...,3150,220463704,3300,181234247,3395,35324332,46440,4247166185,44460.0,1.126765e+09
3233,2012-13,4511,Female,k. all ranges,15785,15510,414135675,15775,474364392,4175,...,1490,39447519,1485,32817672,1540,5543986,15765,454250322,9940.0,4.415670e+07
492,2014-15,5616,Female,i. all ranges,2153,2117,81569732,2149,92654863,195,...,32,524791,28,433878,32,49929,2148,90955319,1781.0,1.366949e+07
6003,2016-17,1494,Male,k. all ranges,19265,18770,1453092011,19256,1617222072,8069,...,1133,59112777,1104,49135660,1163,8708222,19242,1543339070,18025.0,3.851369e+08
2208,2011-12,2541,Female,k. all ranges,15055,14995,812388663,15055,869102847,4655,...,425,8870869,440,7359946,475,741506,14995,829650901,14075.0,1.620244e+08
3997,2013-14,2531,Female,k. all ranges,13039,12627,1183419965,13037,1589677852,4200,...,2471,289932431,2178,121122637,2472,167905775,13030,1487804360,12563.0,4.384779e+08
774,2015-16,3991,Female,i. all ranges,36,36,1204332,36,1456792,13,...,7,79861,6,23510,8,56351,36,1407445,25.0,2.127329e+05
3859,2012-13,9391,Male,k. all ranges,255,255,5329777,255,6094801,40,...,10,97997,10,54946,10,33002,255,5808850,140.0,3.869210e+05
5945,2016-17,9333,Female,k. all ranges,31,31,808044,31,872632,15,...,0,0,0,0,0,0,31,796468,19.0,6.076500e+04
4006,2013-14,2600,Female,k. all ranges,125,123,7524427,124,7927181,17,...,0,0,0,0,0,0,124,7789672,102.0,1.685649e+06
4929,2014-15,5321,Male,k. all ranges,3846,3769,153303749,3843,171292455,502,...,157,4717173,151,4004015,169,473208,3843,167335357,2806.0,2.970764e+07
4646,2014-15,5411,Female,k. all ranges,21255,21029,876417244,21242,927336342,3009,...,412,6434469,404,5722860,445,10751,21232,908220604,17863.0,1.445450e+08
2487,2011-12,9324,Female,k. all ranges,115,115,2492348,115,2758095,25,...,5,11614,5,36356,5,-24742,115,2620151,85.0,2.038820e+05